!x 0.10 0.11 0.12 0.13 0.14 0.15 0.16 0.17 0.18
!y 42.0 41.5 45.0 45.5 45.0 47.5 49.0 55.0 50.0
!先画出散点图
x=0.10:0.01:0.18;
y=[42.0,41.5,45.0,45.5,45.0,47.5,49.0,55.0,50.0];
plot(x,y,'+')
!可知y与x大致为线性关系
%设回归模型为 y=β0+β1x，用regress和rcoplot编程如下
clc,clear
x1=[0.10:0.01:0.18];
y=[42.0,41.5,45.0,45.5,45.0,47.5,49.0,55.0,50.0];
x=[ones(9,1),x1'];
[b,bint,r,rint,stats]=regress(y',x);
b,bint,stats,rcoplot(r,rint)
% 得到
%     b=27.4722      137.5000
%     bint=18.6851   36.2594
%          75.7755   199.2245
%     stats=0.7985 27.7469 0.0012
% 即     β0=27.4722，    β1=137.5000，
%       β0的置信区[18.6851，36.2594]， 
%       β1的置信区间是[75.7755，199.2245]；
% R2=0.7985，F =27.7469， p = 0.0012。可知所
% 设回归模型成立。

% 观察命令rcoplot(r,rint)所画的残差分布，除第8
% 个数据外其余残差的置信区间均包含零点，第8个
% 点应视为异常点，将其剔除后重新计算，可得
% 
% b=30.7280 109.3985
% bint=26.2805 35.2834
%      76.9014 141.8955
% stats=0.9188 67.8534 0.0002
% 应该用修改后的这个结果。
