%1、数据输入：
x1=[7 1 11 11 7 11 3 1 2 21 1 11 10]';
x2=[26 29 56 31 52 55 71 31 54 47 40 66 68]';
x3=[6 15 8 8 6 9 17 22 18 4 23 9 8]';
x4=[60 52 20 47 33 22 6 44 22 26 34 12 12]';
y=[78.5 74.3 104.3 87.6 95.9 109.2 102.7 72.5 93.1 115.9 83.8 113.3 109.4]';
x=[x1 x2 x3 x4];

%2、逐步回归：
%（1）现在初始模型中取全部自变量：
stepwise(x,y)
%得图Stepwise Plot 和表Stepwise Table
%图Stepwise Plot中四条直线都是虚线，说明模型的显著性不好
%从表Stepwise Table中看出变量x3和x4的显著性最差.（系数接近0）
%(2)在图Stepwise Plot中点击直线3和直线4，移去变量x3和x4
%移去变量x3和x4后模型具有显著性.
%    虽然剩余标准差（RMSE）没有太大的变化，但是统计量F的
%值明显增大，因此新的回归模型更好.

%(3）对变量y和x1、x2作线性回归：
X=[ones(13,1) x1 x2];
b=regress(y,X)
% %得结果：b =
%            52.5773
%            1.4683
%            0.6623
% 故最终模型为：y=52.5773+1.4683x1+0.6623x2
